#include <stdio.h>

int main(void) {
  int arr01[6] = {10, 20, 30, 40, 50, 60};
  int arr02[2][3] = {10, 20, 30, 40, 50, 60};

  int arr03[2][3] = {10, 20, 30};
  printf("%d %d %d %d %d %d", arr03[0][0], arr03[0][1], arr03[0][2],
         arr03[1][0], arr03[1][1], arr03[1][2]);
  // 10, 20, 30, 0, 0, 0

  int arr04[2][3] = {{10, 20, 30}, {40, 50, 60}}; // 가장 많이 사용함

  int arr05[3][4] = {{10, 20},
                     {30, 40, 50, 60},
                     {0, 0, 70, 80}}; // 초기화 하지 않은 요소는 0이 됨.

  arr_col_len = sizeof(arr[0]) /
                sizeof(arr[0][0]); // 2차원 배열의 열의 길이(row)를 계산함.
  arr_row_len = (sizeof(arr) / arr_col_len) /
                sizeof(arr[0][0]); // 행의 길이(col)를 계산함.

  int arr06[][4] = {
      {10, 20}, {30, 40, 50, 60}, {0, 0, 70, 80}}; // 행 생략 가능. 열은 불가능.
}